app/controllers/comments_controller.rb

	def index
		@post = Post.find(params[:post_id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def new
		@post = Post.find(params[:post_id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def create
		@commentable = find_commentable
		@comments_count = @commentable.comments.size
		params[:comment].merge!(:user_id => current_user.id)
    @comment = @commentable.comments.build(params[:comment])
		@comment.parent_id = nil if @comment.ancestory.nil?
    if @comment.save
---
SELECT count(*) AS count_all FROM `comments` WHERE (`comments`.commentable_id = 5 AND `comments`.commentable_type = 'Post')
INSERT INTO `comments` (`commentable_type`, `updated_at`, `commentable_id`, `ancestory`, `content`, `user_id`, `active`, `created_at`) VALUES(NULL, '2010-05-20 04:00:41', NULL, NULL, 'test', 1, 1, '2010-05-20 04:00:41')