app/controllers/posts_controller.rb

  def index
    #@posts = Post.all
    @posts = Post.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `posts` ORDER BY created_at DESC LIMIT 0, 50
SELECT count(*) AS count_all FROM `posts`

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO `posts` (`created_at`, `title`, `body`, `published`, `updated_at`, `user_id`, `comments_count`, `views_count`, `published_at`) VALUES('2010-05-08 04:58:23', 'First post', ' 1. A user requests a password reset\r\n 2. An email is sent to them with a link to reset their password\r\n 3. The user verifies their identity be using the link we emailed them\r\n 4. They are presented with a basic form to change their password\r\n 5. After they change their password we log them in, redirect them to their account, and expire the URL we just sent them\r\n', NULL, '2010-05-08 04:58:23', NULL, NULL, NULL, NULL)

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 3)
UPDATE `posts` SET `body` = '<object width=\"480\" height=\"385\"><param name=\"movie\" value=\"http://www.youtube.com/v/NkxytdqxyjI&hl=en_US&fs=1&\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://www.youtube.com/v/NkxytdqxyjI&hl=en_US&fs=1&\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"480\" height=\"385\"></embed></object>', `updated_at` = '2010-05-21 01:05:24' WHERE `id` = 5