app/controllers/users_controller.rb

INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `email`) VALUES('_NOgCc6jP8vPir_RJG3s', '2010-05-07 08:48:14', '2010-05-07 08:48:14', '23ab199c9b05124794eba862af656a1ad33755baad448ebf2aea32978135ad29c45f63093caec0d13be79f20a51c32d3a6243d4f258380c2e393c86306c0f35b', '3FExQH_fH6Ax2_lEnF9n', '2010-05-07 08:48:14', 0, '127.0.0.1', 'fHQoHIgsljUQJdlE-fR_', '2010-05-07 08:48:14', 'a82b2503fa1f6644bcd323f715ec4a3f090f912bd51fd1ea0a9b63c43d5eb2e167bb4f1b66c477d60fc3c97f59bb28a522bbe36c445f330a594a744e29f7d028', 1, NULL, 'aslan', 'aslanir@yahoo.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save